In [2]:
# https://yandex.ru/cup/profile/

# https://yandex.ru/cup/algorithm/analysis/

In [13]:
import numpy as np
import pandas as pd
from math import factorial
from datetime import datetime

In [ ]:
"""
task A
""";

In [4]:
dfa1=pd.read_csv('log.csv')

In [10]:
# dfa1.describe(include='all')

In [20]:
dfa1['date']=pd.to_datetime(dfa1['date'].apply(lambda date:datetime.strptime(date,'%Y-%m-%d_%H:%M:%S')))

In [21]:
dfa1.head()

                 date    user  event_type parameter
0 2020-04-01 00:01:44  657917           4       NaN
1 2020-04-01 00:00:36  660683           1       NaN
2 2020-04-01 00:02:01  799063           2       NaN
3 2020-04-01 00:04:08  817587           2   unknown
4 2020-04-01 00:08:42  626040           0       NaN

In [106]:
dfa2=dfa1.sort_values(by=[
    'user',
    'date',
],ascending=[
    True,
    True,
])

In [107]:
dfa2.head()

                     date    user  event_type parameter
1817  2020-04-01 09:29:12  100187           1   unknown
4857  2020-04-01 17:18:31  100187           3     video
8984  2020-04-02 10:15:31  100187           2   picture
9138  2020-04-02 10:45:31  100187           2     video
13714 2020-04-03 06:45:33  100187           4   picture

In [108]:
dfa2=dfa2.reset_index(drop=True)

In [109]:
dfa2['user'].nunique()

6000

In [110]:
dfta1=dfa2['date']-dfa2['date'].shift()
is_sess=~((pd.to_timedelta('0m')<dfta1) & (dfta1<pd.to_timedelta('30m')))
is_sess

0         True
1         True
2         True
3         True
4         True
          ...
199995    True
199996    True
199997    True
199998    True
199999    True
Name: date, Length: 200000, dtype: bool

In [111]:
dfa3=dfa2
dfa3['date']=dfa3['date'].dt.date

In [115]:
dfa3[is_sess][[
    'date',
    'user',
]].groupby(by=[
    'date',
]).agg('count')

            user
date
2020-04-01  7070
2020-04-02  5866
2020-04-03  6663
2020-04-04  5983
2020-04-05  7932
2020-04-06  7079
2020-04-07  8609
2020-04-08  6265
2020-04-09  6511
2020-04-10  8429
2020-04-11  4802
2020-04-12  8088
2020-04-13  7289
2020-04-14  3148
2020-04-15  6591
2020-04-16  7700
2020-04-17  7300
2020-04-18  2417
2020-04-19  6058
2020-04-20  7645
2020-04-21  7882
2020-04-22  8886
2020-04-23  9153
2020-04-24  3735
2020-04-25  9155
2020-04-26  6004
2020-04-27  5992
2020-04-28  4598
2020-04-29  8554
2020-04-30  3346

In [117]:
dfa4=dfa1

In [118]:
dfa4.head()

                 date    user  event_type parameter
0 2020-04-01 00:01:44  657917           4       NaN
1 2020-04-01 00:00:36  660683           1       NaN
2 2020-04-01 00:02:01  799063           2       NaN
3 2020-04-01 00:04:08  817587           2   unknown
4 2020-04-01 00:08:42  626040           0       NaN

In [125]:
dfa5=dfa4[(dfa4['event_type']==3)&(dfa4['parameter']=='picture')]

In [128]:
dfa5['date']=dfa5['date'].dt.date

In [129]:
dfa5.head()

          date    user  event_type parameter
30  2020-04-01  164339           3   picture
39  2020-04-01  811755           3   picture
58  2020-04-01  231135           3   picture
79  2020-04-01  476957           3   picture
90  2020-04-01  453334           3   picture

In [133]:
dfa5.shape[0]

6695

In [135]:
dfa6=dfa5.drop_duplicates(subset=[
    'date',
    'user',
])

In [136]:
dfa6.shape[0]

6595

In [137]:
dfa6.head()

          date    user  event_type parameter
30  2020-04-01  164339           3   picture
39  2020-04-01  811755           3   picture
58  2020-04-01  231135           3   picture
79  2020-04-01  476957           3   picture
90  2020-04-01  453334           3   picture

In [141]:
dfa6[[
    'date',
    'user',
]].groupby(by=[
    'date'
]).agg('count').max()

user    330
dtype: int64

In [142]:
dfa1.head()

                 date    user  event_type parameter
0 2020-04-01 00:01:44  657917           4       NaN
1 2020-04-01 00:00:36  660683           1       NaN
2 2020-04-01 00:02:01  799063           2       NaN
3 2020-04-01 00:04:08  817587           2   unknown
4 2020-04-01 00:08:42  626040           0       NaN

In [144]:
dfa7=dfa1.sort_values(by=[
    'date'
])

In [145]:
dfa7.head()

                 date    user  event_type parameter
1 2020-04-01 00:00:36  660683           1       NaN
0 2020-04-01 00:01:44  657917           4       NaN
2 2020-04-01 00:02:01  799063           2       NaN
3 2020-04-01 00:04:08  817587           2   unknown
4 2020-04-01 00:08:42  626040           0       NaN

In [149]:
def calc_events(ts):
    begin=ts
    end=ts+pd.to_timedelta('9m59s')
    return ((begin<=dfa7['date']) & (dfa7['date']<=end)).sum()

In [155]:
dates=dfa7['date'].values

In [164]:
res=[]
i2=1
delta=pd.to_timedelta('9m59s')
num_dates=len(dates)
for i1,date in enumerate(dates):
    while i2<num_dates:
        if date+delta>=dates[i2]:
            i2+=1
            continue
        else:
            break
    res.append(i2-i1)

In [163]:
dfa7['date'][:15]

1    2020-04-01 00:00:36
0    2020-04-01 00:01:44
2    2020-04-01 00:02:01
3    2020-04-01 00:04:08
4    2020-04-01 00:08:42
5    2020-04-01 00:09:16
6    2020-04-01 00:09:20
7    2020-04-01 00:16:19
8    2020-04-01 00:17:36
9    2020-04-01 00:18:13
10   2020-04-01 00:19:16
11   2020-04-01 00:21:02
12   2020-04-01 00:21:08
13   2020-04-01 00:24:32
14   2020-04-01 00:27:18
Name: date, dtype: datetime64[ns]

In [166]:
dfa7['task_3']=res

In [168]:
dfa7[dfa7['task_3']==dfa7['task_3'].max()]

                      date    user  event_type parameter  task_3
144052 2020-04-22 13:38:18  882146           1       NaN     118
144053 2020-04-22 13:38:25  325622           4     music     118
144054 2020-04-22 13:38:32  415346           4     music     118
165830 2020-04-25 12:45:53  853935           4     video     118
165831 2020-04-25 12:45:57  510143           2     video     118

In [ ]:
# B. Колода карт (3 балла)

In [313]:
from scipy.special import binom

"""
Из хорошо перетасованной малой колоды карт (от семерок до тузов, 4 масти, всего 32 карты) вам выдают 6 карт подряд. С какой вероятностью выданные карты в сумме дают 50 очков? Считайте, что валет - это 11 очков, дама - 12 очков, король - 13 очков, туз - 14 очков. Число очков для остальных карт совпадает с их номиналом.

Ответ округлите до шестого знака после точки.

4*7+2*8=44
14*4+13*2=82

possibles results = [44,82]

res<=49
res>=51

k=6
n=8*4=32
all=906192=binom(n,k)

len(list(itertools.combinations(cards,k)))#=906192

""";
k=6
n=32
cards=list(range(n))

906192

In [318]:
def res(comb):
    return sum([card//4+7 for card in comb])

In [321]:
cnt=0
for comb in itertools.combinations(cards,k):
    if res(comb)==50:
        cnt+=1

In [323]:
cnt
round(cnt/binom(n,k),6)

0.002977

In [311]:
import itertools

In [177]:
"""
C. Билеты в кино (3 балла)

Покупая билет в кино, пользователь сервиса может указать свой email или телефон, либо email и телефон сразу. Напишите алгоритм, который по списку таких транзакций находит пользователя, купившего больше всех билетов. В качестве ответа укажите число строк в исходном файле, которые относятся к этому пользователю. Под пользователем понимается email, телефон или комбинация обоих идентификаторов, если их удастся связать по логам покупок.


""";
dfc1=pd.read_csv('logC.csv',names=[0,1],dtype=str)

In [178]:
dfc1.head()

                              0              1
0  user_11799@contest.yandex.ru  8801111111500
1   user_5682@contest.yandex.ru  8801111114200
2  user_14735@contest.yandex.ru   880111116114
3  user_11725@contest.yandex.ru   880111117475
4   user_7948@contest.yandex.ru   880111112790

In [179]:
dict_email_tel=dict()
dict_tel_email=dict()

In [181]:
for email,tel in dfc1.values:
    if email in dict_email_tel.keys():
        dict_email_tel[email]|=set([tel])
    else:
        dict_email_tel[email]=set([tel])
    if tel in dict_tel_email.keys():
        dict_tel_email[tel]|=set([email])
    else:
        dict_tel_email[tel]=set([email])

In [185]:
len(dict_email_tel)>len(dict_tel_email)

True

In [192]:
for e in dict_tel_email[list_tels[0]]:
    e

In [197]:
dict_user_id_and_emails_or_phones=dict()
dict_email_or_phone_and_user_id=dict()
list_tels=list(dict_tel_email.keys())
max_num_users=len(list_tels)
user_id=-1
i1=0
already_checked_tels_and_emails=set()
while i1<max_num_users:
    if list_tels[i1] in dict_email_or_phone_and_user_id.keys():
        current_user_id=dict_email_or_phone_and_user_id[list_tels[i1]]
    else:
        user_id+=1
        current_user_id=user_id
        dict_email_or_phone_and_user_id[list_tels[i1]]=current_user_id
        dict_user_id_and_emails_or_phones[current_user_id]=set([list_tels[i1]])
    for_checking=list(dict_tel_email[list_tels[i1]])
    while True:
        elem=for_checking[0]
        dict_email_or_phone_and_user_id[elem]=current_user_id
        if elem in dict_user_id_and_emails_or_phones[current_user_id]:
            pass
        else:
            dict_user_id_and_emails_or_phones[current_user_id]|=set([elem])
            list_linked=dict_email_tel[elem] if elem in dict_email_tel.keys() else dict_tel_email[elem]
            new=[e for e in list_linked if e not in dict_email_or_phone_and_user_id.keys()]
            for_checking+=new
        for_checking=for_checking[1:]
        if for_checking==[]:
            break
    i1+=1

In [201]:
len(dict_user_id_and_emails_or_phones)

1880

In [204]:
dict_user_id_and_emails_or_phones[10]

{'8801111110814',
 '8801111111608',
 '8801111113444',
 '880111112290',
 'user_12195@contest.yandex.ru',
 'user_5115@contest.yandex.ru',
 'user_7633@contest.yandex.ru'}

In [200]:
len(dict_email_tel)+len(dict_tel_email)==len(dict_email_or_phone_and_user_id)

True

In [208]:
sum(dfc1[0].apply(lambda m:dict_email_or_phone_and_user_id[m])==dfc1[1].apply(lambda m:dict_email_or_phone_and_user_id[m]))==len(dfc1)

True

In [210]:
dfc1[2]=dfc1[0].apply(lambda m:dict_email_or_phone_and_user_id[m])

In [211]:
dfc1.head()

                              0              1  2
0  user_11799@contest.yandex.ru  8801111111500  0
1   user_5682@contest.yandex.ru  8801111114200  0
2  user_14735@contest.yandex.ru   880111116114  1
3  user_11725@contest.yandex.ru   880111117475  2
4   user_7948@contest.yandex.ru   880111112790  0

In [218]:
dfc1[[0,2]].groupby(by=[
    2,
]).agg('count').sort_values(by=0,ascending=False)

         0
2
0     5192
11     261
77      68
29      67
150     64
...    ...
1381     1
1382     1
540      1
858      1
1879     1

[1880 rows x 1 columns]

In [ ]:
"""
D. Эпидемия на «Тортуге» (3 балла)
https://contest.yandex.ru/yacup_analytics/contest/19040/problems/D/

""";

In [326]:
n=10
p=0.08
experiments=100000
res=[]
for e in range(experiments):
    cnt=1
    number=124
    ill=1
    health=number-ill
    graph=[list(np.random.binomial(n,p,size=13))]
    while health>0:
        p_new=health/number
        graph.append([0]*cnt+list(np.random.binomial(n,p,size=13)))
        for ill_ in graph:
        ill+=p_new
        health-=ill
        cnt+=1
    res.append(cnt)

KeyboardInterrupt:

In [ ]:
pd.Series(res).value_counts()

In [327]:
np.random.binomial(n,p,size=13)

array([2, 0, 1, 2, 1, 2, 2, 3, 0, 1, 1, 0, 0])

In [328]:
[0]*5

[0, 0, 0, 0, 0]

In [ ]:
"""
E. Пила (3 балла)
https://contest.yandex.ru/yacup_analytics/contest/19040/problems/E/

""";

In [ ]:
with open('input.txt','r') as f:
    input=f.read()
input=input.split('\n')
n,k=input[0]
array=input[1].split()
candidates=input[2].split()
candidates=list(map(int,candidates))
candidates.sort()
res=[]
for i1,place in enumerate(array):
    if place!='-':
        continue
    if i1%2==0:
        
    array[i1]

In [301]:
from math import log2
100000*log2(100000)

1660964.0474436812